'''
Текстовый файл 24.txt состоит не более чем из 107 прописных латинских букв. 
    Определите максимальное количество идущих подряд символов, 
    среди которых не содержится три символа из 
    набора букв A, B, C, D в различных комбинациях (с учётом повторений), стоящих рядом.
'''

c = 0
m = 0

f = open('24.txt').readline()

banned = ['A', 'B', 'C']

for i in range(len(f)):
    if f[i] not in banned:
        c += 1
        m = max(m, c)
    else:
        count = 0

print(m)