

"""код представленный в task/15/ представляет собой алгоритм который использует нестандартный подход"""

""""если в задание сказано, что нам надо найти МИНИМАЛЬНОЕ А при котором ...., то работает конструкция"""
A=0 
if("expression")!=1:
    ...
"напомню, что  для полного понимая здесь проиходящего надо видеть полной код"
# -----------------------------------
""""если в задание сказано, что нам надо найти МАКСИМАЛЬНОЕ А при котором ...., то работает конструкция"""
A=1 
if("expression")!=0:
    ...


# made by isp
