def f(x, y):
    # продолжаем если x = y
    if x == y:
        return 1
    
    # заканчиваем если x > а иногда бывает что надо числа не входили.
    # к примеру x == 22: return 0
    if x > y:
        return 0
    
    # иначе выводим выраение с функцией. примерная функция f(x+1,y)+f(x+2,y) ...
    return f(0)

# иногда есть значение которые  должны входить в диапазон.
# к примеру входят в промежуток num (если сказано, что число num должно быть учтено)
print(f(start, num) * f(num, end))

# made by isp
