# Это наглядное решение задания №8.
# условия:
# восьмеричная с.с;шестизначные числа;не должно быть 2;не должны стоять рядом 2 четных и 2 нечетных

# комбинаторика
from itertools import *
# счетчик
c=0

# перебираем все значения
for i in permutations('0134567',r=6):
    # переводим из кортежа в строку для удобства в работе
    i=''.join(i)
    # проверка на ноль
    if i[0] !='0':
        # алгоритм проверки не идущих подряд чисел
        #
        i=i.replace('5','1').replace('3','1').replace('7','1')
        i=i.replace('4','0').replace('6','0')
        if '00' not in i and '11' not in i:
            c+=1
        #
print(c)
<<<<<<< HEAD

# made by isp
=======
>>>>>>> origin/main
